Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF458.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXM0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXM0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF1B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM0EID0" edc:desc="" edc:mask="0x1" edc:name="RXM0EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID1" edc:desc="" edc:mask="0x1" edc:name="RXM0EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID2" edc:desc="" edc:mask="0x1" edc:name="RXM0EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID3" edc:desc="" edc:mask="0x1" edc:name="RXM0EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID4" edc:desc="" edc:mask="0x1" edc:name="RXM0EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID5" edc:desc="" edc:mask="0x1" edc:name="RXM0EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID6" edc:desc="" edc:mask="0x1" edc:name="RXM0EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM0EID7" edc:desc="" edc:mask="0x1" edc:name="RXM0EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXM1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXM1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF1C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM1SID3" edc:desc="" edc:mask="0x1" edc:name="RXM1SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID4" edc:desc="" edc:mask="0x1" edc:name="RXM1SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID5" edc:desc="" edc:mask="0x1" edc:name="RXM1SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID6" edc:desc="" edc:mask="0x1" edc:name="RXM1SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID7" edc:desc="" edc:mask="0x1" edc:name="RXM1SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID8" edc:desc="" edc:mask="0x1" edc:name="RXM1SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID9" edc:desc="" edc:mask="0x1" edc:name="RXM1SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID10" edc:desc="" edc:mask="0x1" edc:name="RXM1SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nn" edc:cname="RXM1SIDL" edc:desc="" edc:impl="0xe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu---uu" edc:name="RXM1SIDL" edc:nzwidth="0x8" edc:por="xxx---xx" edc:_addr="0xF1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM1EID16" edc:desc="" edc:mask="0x1" edc:name="RXM1EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID17" edc:desc="" edc:mask="0x1" edc:name="RXM1EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RXM1SID0" edc:desc="" edc:mask="0x1" edc:name="RXM1SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID1" edc:desc="" edc:mask="0x1" edc:name="RXM1SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1SID2" edc:desc="" edc:mask="0x1" edc:name="RXM1SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXM1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXM1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF1E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM1EID8" edc:desc="" edc:mask="0x1" edc:name="RXM1EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID9" edc:desc="" edc:mask="0x1" edc:name="RXM1EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID10" edc:desc="" edc:mask="0x1" edc:name="RXM1EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID11" edc:desc="" edc:mask="0x1" edc:name="RXM1EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID12" edc:desc="" edc:mask="0x1" edc:name="RXM1EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID13" edc:desc="" edc:mask="0x1" edc:name="RXM1EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID14" edc:desc="" edc:mask="0x1" edc:name="RXM1EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID15" edc:desc="" edc:mask="0x1" edc:name="RXM1EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXM1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXM1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXM1EID0" edc:desc="" edc:mask="0x1" edc:name="RXM1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID1" edc:desc="" edc:mask="0x1" edc:name="RXM1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID2" edc:desc="" edc:mask="0x1" edc:name="RXM1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID3" edc:desc="" edc:mask="0x1" edc:name="RXM1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID4" edc:desc="" edc:mask="0x1" edc:name="RXM1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID5" edc:desc="" edc:mask="0x1" edc:name="RXM1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID6" edc:desc="" edc:mask="0x1" edc:name="RXM1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXM1EID7" edc:desc="" edc:mask="0x1" edc:name="RXM1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
