Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF458.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF38">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D20" edc:desc="" edc:mask="0x1" edc:name="TXB1D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D21" edc:desc="" edc:mask="0x1" edc:name="TXB1D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D22" edc:desc="" edc:mask="0x1" edc:name="TXB1D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D23" edc:desc="" edc:mask="0x1" edc:name="TXB1D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D24" edc:desc="" edc:mask="0x1" edc:name="TXB1D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D25" edc:desc="" edc:mask="0x1" edc:name="TXB1D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D26" edc:desc="" edc:mask="0x1" edc:name="TXB1D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D27" edc:desc="" edc:mask="0x1" edc:name="TXB1D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TBB1D23" edc:desc="" edc:mask="0x1" edc:name="TBB1D23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF39">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D30" edc:desc="" edc:mask="0x1" edc:name="TXB1D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D31" edc:desc="" edc:mask="0x1" edc:name="TXB1D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D32" edc:desc="" edc:mask="0x1" edc:name="TXB1D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D33" edc:desc="" edc:mask="0x1" edc:name="TXB1D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D34" edc:desc="" edc:mask="0x1" edc:name="TXB1D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D35" edc:desc="" edc:mask="0x1" edc:name="TXB1D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D36" edc:desc="" edc:mask="0x1" edc:name="TXB1D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D37" edc:desc="" edc:mask="0x1" edc:name="TXB1D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF3A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D40" edc:desc="" edc:mask="0x1" edc:name="TXB1D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D41" edc:desc="" edc:mask="0x1" edc:name="TXB1D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D42" edc:desc="" edc:mask="0x1" edc:name="TXB1D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D43" edc:desc="" edc:mask="0x1" edc:name="TXB1D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D44" edc:desc="" edc:mask="0x1" edc:name="TXB1D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D45" edc:desc="" edc:mask="0x1" edc:name="TXB1D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D46" edc:desc="" edc:mask="0x1" edc:name="TXB1D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D47" edc:desc="" edc:mask="0x1" edc:name="TXB1D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF3B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D50" edc:desc="" edc:mask="0x1" edc:name="TXB1D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D51" edc:desc="" edc:mask="0x1" edc:name="TXB1D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D52" edc:desc="" edc:mask="0x1" edc:name="TXB1D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D53" edc:desc="" edc:mask="0x1" edc:name="TXB1D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D54" edc:desc="" edc:mask="0x1" edc:name="TXB1D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D55" edc:desc="" edc:mask="0x1" edc:name="TXB1D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D56" edc:desc="" edc:mask="0x1" edc:name="TXB1D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D57" edc:desc="" edc:mask="0x1" edc:name="TXB1D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF3C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D60" edc:desc="" edc:mask="0x1" edc:name="TXB1D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D61" edc:desc="" edc:mask="0x1" edc:name="TXB1D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D62" edc:desc="" edc:mask="0x1" edc:name="TXB1D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D63" edc:desc="" edc:mask="0x1" edc:name="TXB1D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D64" edc:desc="" edc:mask="0x1" edc:name="TXB1D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D65" edc:desc="" edc:mask="0x1" edc:name="TXB1D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D66" edc:desc="" edc:mask="0x1" edc:name="TXB1D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D67" edc:desc="" edc:mask="0x1" edc:name="TXB1D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF3D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D70" edc:desc="" edc:mask="0x1" edc:name="TXB1D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D71" edc:desc="" edc:mask="0x1" edc:name="TXB1D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D72" edc:desc="" edc:mask="0x1" edc:name="TXB1D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D73" edc:desc="" edc:mask="0x1" edc:name="TXB1D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D74" edc:desc="" edc:mask="0x1" edc:name="TXB1D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D75" edc:desc="" edc:mask="0x1" edc:name="TXB1D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D76" edc:desc="" edc:mask="0x1" edc:name="TXB1D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1D77" edc:desc="" edc:mask="0x1" edc:name="TXB1D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
