Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF458.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCPAS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCPAS" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSSBD" edc:desc="" edc:mask="0x3" edc:name="PSSBD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSSAC" edc:desc="" edc:mask="0x3" edc:name="PSSAC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ECCPAS" edc:desc="" edc:mask="0x7" edc:name="ECCPAS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ECCPASE" edc:desc="" edc:mask="0x1" edc:name="ECCPASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSSBD0" edc:desc="" edc:mask="0x1" edc:name="PSSBD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSBD1" edc:desc="" edc:mask="0x1" edc:name="PSSBD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC0" edc:desc="" edc:mask="0x1" edc:name="PSSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSSAC1" edc:desc="" edc:mask="0x1" edc:name="PSSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS0" edc:desc="" edc:mask="0x1" edc:name="ECCPAS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS1" edc:desc="" edc:mask="0x1" edc:name="ECCPAS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS2" edc:desc="" edc:mask="0x1" edc:name="ECCPAS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP1DEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP1DEL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPDC" edc:desc="" edc:mask="0xff" edc:name="EPDC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EPDC0" edc:desc="" edc:mask="0x1" edc:name="EPDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC1" edc:desc="" edc:mask="0x1" edc:name="EPDC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC2" edc:desc="" edc:mask="0x1" edc:name="EPDC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC3" edc:desc="" edc:mask="0x1" edc:name="EPDC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC4" edc:desc="" edc:mask="0x1" edc:name="EPDC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC5" edc:desc="" edc:mask="0x1" edc:name="EPDC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC6" edc:desc="" edc:mask="0x1" edc:name="EPDC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPDC7" edc:desc="" edc:mask="0x1" edc:name="EPDC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xFB8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP1CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFBA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ECCP1M" edc:desc="" edc:mask="0xf" edc:name="ECCP1M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="EDC1B" edc:desc="" edc:mask="0x3" edc:name="EDC1B" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="EPWM1M" edc:desc="" edc:mask="0x3" edc:name="EPWM1M" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ECCP1M0" edc:desc="" edc:mask="0x1" edc:name="ECCP1M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP1M1" edc:desc="" edc:mask="0x1" edc:name="ECCP1M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP1M2" edc:desc="" edc:mask="0x1" edc:name="ECCP1M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ECCP1M3" edc:desc="" edc:mask="0x1" edc:name="ECCP1M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDC1B0" edc:desc="" edc:mask="0x1" edc:name="EDC1B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDC1B1" edc:desc="" edc:mask="0x1" edc:name="EDC1B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPWM1M0" edc:desc="" edc:mask="0x1" edc:name="EPWM1M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPWM1M1" edc:desc="" edc:mask="0x1" edc:name="EPWM1M1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EDC2B0" edc:desc="" edc:mask="0x1" edc:name="EDC2B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDC2B1" edc:desc="" edc:mask="0x1" edc:name="EDC2B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ECCPR1" edc:desc="" edc:name="ECCPR1" edc:nzwidth="0x10" edc:_addr="0xFBB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ECCPR1" edc:desc="" edc:mask="0xffff" edc:name="ECCPR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ECCPR1L" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFBB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ECCPR1L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="ECCPR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
